# ClearWallPeaks

## Description
Removes all wall peaks from the referenced wall.

```pascal
PROCEDURE ClearWallPeaks(h : HANDLE);
```

```python

def vs.ClearWallPeaks(h):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to wall.|

## Remarks
remove all peaks in this wall

## Version
Availability: from VectorWorks9.0
## Category
* Objects - Walls